{
  "dev_story": [
    "제 첫 게임, 슈뢰딩거 베이스볼을 끝까지 즐겨주셔서 정말 감사합니다!",
    "사실 보잘것 없는 게임이지만, 어릴 때부터 꿈꾸던 '나만의 게임 만들기'를 ",
    "드디어 해볼 수 있어서 만드는 내내 정말 즐거웠습니다.",
    " ",
    "이 게임의 아이디어는 가짜 숫자야구게임의 변형룰에서 시작됐습니다. ",
    "처음엔 사람간에 치열한 두뇌 게임을 생각했죠. 수비자가 제한없이 거짓말을 할 수 있고, ",
    "공격자는 '이거는 말이 안 된다!' 싶을 때 '모순'을 선언해서 끝내는 방식이었거든요. ",
    "반대로 수비자가 모순이 아니라는 걸 '반증'하면 이기는 룰으로요.",
    " ",
    "근데 막상 AI와 시뮬레이션을 돌려보니까 생각보다 어렵더라고요. ",
    "단 3턴 만에 논리적 모순이 발생하기도 하고 오기도, 완벽하게 거짓말을 섞어가며 카운트를 준다는 게 ",
    "생각보다 엄청난 사고력을 필요로 한다는 걸 깨달았습니다. ",
    "\"완벽하게 거짓말하는 상대를 이기려면 몇 번이나 걸릴까?\" 라는 질문에서 이 게임이 구상되었습니다.",
    " ",
    "이름도 처음엔 '패러독스 베이스볼' 같은 걸 생각했는데, \"슈뢰딩거 베이스볼\"이 꽂히더라고요. ",
    "모든 숫자의 가능성이 중첩되어 있다가, 관측을 자세히 할수록 가능성이 줄어들고",
    "결국 하나의 숫자로 수렴하는 양자역학 컨셉! 제가 원하던 느낌이랑 딱 맞아서 파바박 만들어봤습니다.",
    " ",
    "사실 전 프로그래밍 지식이 제로에 가까워서 AI를 쓴다고 해도 이렇게 빠르게 될 줄은 몰랐습니다. ",
    "구상에 반나절, 코드 짜는 데 하루, 마무리에 한나절 정도 걸렸는데, ",
    "막히는 걸 바로바로 물어보면서 코드를 만들어갈 수 있어서 빨랐던 것 같습니다.",
    " ",
    "마음 같아서는 '개쳐귀여운 고양이' 이미지랑 컨셉을 막 쏟아붓고 싶었는데... 생각보다 어렵더라고요. ",
    "이미지를 찾아도 게임에 넣으니깐 제가 원하는 느낌이 안 살아서 결국 지금같은 모습이 됐습니다. ",
    " ",
    "세상이 참 빠르게 변하는 것 같습니다. 코딩 문외한인 제가 게임을 만들수 있다니요.",
    "앞으로도 재밌는 아이디어가 떠오르면 게임을 만들어 보겠습니다. ",
    "어쩌면 슈뢰딩거 베이스볼 PVP버젼도 만들 수 있을 것 같습니다.",
    " ",
    "이상 게임은 끝입니다. ",
    "감사합니다! 고양이는 정말 귀엽네요...",
    "고양이 사진 찾으면서 주워온 귀여운 고양이짤이라도 구경하다 가세요! :) "
  ],
  "endings": {
    "paradox": {
      "type": "Quantum Paradox",
      "result": "불가능한 세계선",
      "message": "축하합니다! 당신은 미시세계의 모든 가능성을 부정하고 <br> 고양이의 위치와 운동량을 모두 알아냈습니다"
    },
    "win": {
      "type": "Quantum Collapse",
      "result": "승리",
      "message": "관측 성공! 당신의 고양이는 살아있었습니다<br>당신은 고양이의 위치만을 알 수 있었습니다"
    },
    "lose": {
      "type": "Quantum Collapse",
      "result": "패배",
      "message": "관측 실패! 당신의 고양이는 사라졌습니다<br>당신은 고양이의 운동량만을 알 수 있었습니다"
    }
  },
  "tips": {
    "fail": [
      {
        "title": "실패 시 참고팁 (1/3)",
        "desc": "이 게임은 처음에 1234, 5678을 입력하고 나머지는 아무렇게나 입력해도<br>마지막 관측확률이 체감상 30%정도 되는 것 같았습니다."
      },
      {
        "title": "실패 시 참고팁 (2/3)",
        "desc": "그리고 고양이의 알고리즘 상 초반에는 계속 Ball 판정을 주기 때문에<br>의심되는 숫자들을 최대한 모든 자리수에 돌려가며 배치하다보면<br>5~6회 사이에는 금새 가능성이 좁혀지게 됩니다."
      },
      {
        "title": "실패 시 참고팁 (3/3)",
        "desc": "어느정도 좌표가 특정된 후 양자구름에 표시된 숫자를 보고 측정을 하면<br>2살 아가 먼치킨이 아닌 이상 양자고양이를 관측할 수 있을겁니다. 화이팅!"
      }
    ],
    "success": [
      {
        "title": "성공 시 참고팁 (1/5)",
        "desc": "눈치를 못채셨을 수도 있지만 이 게임은 관측에 성공을 하든 실패를 하든<br><span style='color:var(--cyan); font-weight:bold;'>Quantum Collapse(양자 붕괴)</span>엔딩이 나옵니다. <br>그렇게 한 것은 관측 성공도 이 게임의 진짜 목표가 아니기 때문입니다."
      },
      {
        "title": "성공 시 참고팁 (2/5)",
        "desc": "단순히 관측 성공을 하는거 자체는 너무 난이도가 낮으니까요. <br><span style='color:var(--cyan); font-weight:bold;'>이 게임은 정확히 6회까지 100%로 양자고양이의 좌표를 특정하고 <br>7회차 측정까지 진행해서 양자고양이를 잡는 게임입니다.</span>"
      },
      {
        "title": "성공 시 참고팁 (3/5)",
        "desc": "이 게임에서 일반 숫자야구의 팁은 큰 도움이 안 될수도 있습니다. <br>양자고양이는 계속해서 최대한 안전해보이는 좌표로 도망칩니다. <br>정확히는 가능한 후보 숫자가 가장 많은 볼카운트 대답한다는 의미죠."
      },
      {
        "title": "성공 시 참고팁 (4/5)",
        "desc": "고정된 알고리즘이기 때문에 똑같은 질문을 100번 하면 100번 똑같이 답합니다.<br> 일정한 빌드를 만들어서 가장 높은 확률을 따라가면 최적화되는 구조입니다. <br>측정 숫자를 교차로 배치해서 몰이사냥을 하듯이 숨을 곳을 좁히세요."
      },
      {
        "title": "성공 시 참고팁 (5/5)",
        "desc": "어차피 깨봤자 개발자의 허접한 감상문 말곤 아무것도 없는데 <br>진짜 굳이 패러독스 엔딩을 보겠다는 건가요? 그런분은 정말 환영입니다. <br>힌트를 드리면 제 클리어 루트는 네번째 측정에서 4.17%가 됩니다. <br> 양자고양이가 포기하는걸 포기하세요."
      }
    ]
  },
  "tutorial": {
    "steps": [
      {
        "step": 1,
        "title": "1. 숫자 입력",
        "desc": "입력 패널의 버튼을 눌러서 입력하거나 키보드 숫자키를 활용해<br>임의의 4자리 수를 입력해보세요."
      },
      {
        "step": 2,
        "title": "2. 양자고양이 좌표 측정",
        "desc": "입력 패널의 엔터키나 키보드 Enter를 통해서 양자 고양이의 좌표를 측정하세요.<br>고양이가 숨어있는 4자리 좌표를 찾으면 됩니다."
      },
      {
        "step": 3,
        "title": "3. 결과 표시 판넬",
        "desc": "S는 숫자와 위치가 모두 맞는 숫자의 개수이며<br>B는 숫자는 맞지만 위치는 틀린 숫자의 개수입니다."
      },
      {
        "step": 4,
        "title": "4. 양자 구름의 의미",
        "desc": "좌표 측정을 진행하다 보면 양자고양이가 위치할 가능성이 있는 좌표들이<br>점차 선명히 보이기 시작합니다."
      },
      {
        "step": 5,
        "title": "5. 관측 확률",
        "desc": "지금까지 판정결과에 부합하는 임의의 숫자로 관측했을 때 찾을 확률입니다.<br>관측은 입력패널의 우상단 보라색 버튼을 통해 진행합니다."
      },
      {
        "step": 6,
        "title": "6. 횟수 제한 및 엔딩",
        "desc": "양자고양이는 언제나 가장 잘 숨을 수 있는 좌표로 도망칩니다.<br><span style='color:var(--red); font-weight:bold;'>7회의 좌표 측정만으로 고양이의 좌표를 찾아보세요!</span><br>고양이의 좌표를 정확히 측정하면 색다른 엔딩이 나올지도?"
      }
    ],
    "button_finish": "게임하러 가기"
  }
}